package soyouarehere.imwork.speed.function.encryption;


import javax.crypto.Cipher;
import javax.crypto.KeyGenerator;
import javax.crypto.SecretKey;

import java.security.*;

import soyouarehere.imwork.speed.util.Base64Utils;

/**
 * Created by li.xiaodong on 2018/8/30.
 */
public class EncryptionTest {


    public static void main(String args[]) {
        try {
//            Md();
            String content = "阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水;l" +
                    "fjasl阿斯利康打飞机啊来得及发了大家lfjasl阿斯利康打飞机啊来lfjasl阿斯利" +
                    "康打飞机啊来得及发了大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿" +
                    "斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯" +
                    "利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfj" +
                    "asl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发" +
                    "垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发" +
                    "垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjas" +
                    "l阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利" +
                    "康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯" +
                    "利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯" +
                    "利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来" +
                    "得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发" +
                    "垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水lfjasl阿斯利康打飞机啊来得及发了大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家" +
                    "发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康" +
                    "打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及" +
                    "发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利" +
                    "康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得" +
                    "及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃" +
                    "圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfja" +
                    "sl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞" +
                    "机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了" +
                    "大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿" +
                    "斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家" +
                    "发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿" +
                    "斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及" +
                    "发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家" +
                    "发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康" +
                    "打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发" +
                    "垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康" +
                    "打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃" +
                    "圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒" +
                    "水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了" +
                    "大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfj" +
                    "asl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及" +
                    "发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得" +
                    "及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利" +
                    "康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒" +
                    "水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了" +
                    "大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来" +
                    "得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯" +
                    "利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒" +
                    "水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利" +
                    "康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家" +
                    "发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得" +
                    "及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得" +
                    "及发了大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家lfjasl阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿" +
                    "斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒" +
                    "水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来" +
                    "得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lf" +
                    "jasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家" +
                    "发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿" +
                    "斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了" +
                    "大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来" +
                    "得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞" +
                    "机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjas" +
                    "l阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得" +
                    "及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃" +
                    "圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯" +
                    "利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康" +
                    "打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒" +
                    "水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞" +
                    "机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来" +
                    "得及发了大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿" +
                    "斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利" +
                    "康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得" +
                    "及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣" +
                    "椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打" +
                    "飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机" +
                    "了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞" +
                    "机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水" +
                    "lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来" +
                    "得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾" +
                    "的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的" +
                    "辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞" +
                    "机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大" +
                    "家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl" +
                    "阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发" +
                    "了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒" +
                    "水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊" +
                    "来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了" +
                    "大家lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机" +
                    "啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发" +
                    "垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水阿斯利康打飞机啊来得及发了大家发垃圾的辣椒水lfjasl阿斯利";
            StringBuffer stringBuffer = new StringBuffer();
            stringBuffer.append(content)
                    .append(content)
                    .append(content);
            String result = stringBuffer.toString();
            String sss = new String("sssssss");
            System.out.println(content.hashCode()+"   :"+sss.hashCode());
            System.out.println(result.getBytes().length);
//            @SuppressLint("NewApi") String baseSign = Base64.getMimeEncoder().encodeToString(content.getBytes());
//            String result = "";
//            System.out.println("加密:" + baseSign+"\n"+"  解密: "+result);

        } catch (Exception e) {
            e.printStackTrace();
        }

    }

    private static void Md() throws Exception {

        //加密内容
        final String content = "hello hello hello";
        /*
         * 单向加密 md5 & sha
         */
        //md5 加密
        MessageDigest md5 = MessageDigest.getInstance("md5");
        byte[] md5SecretStr = md5.digest(content.getBytes());
        System.out.println("md5 加密 : { " + Base64Utils.encodeString(md5SecretStr) + " }");

        //sha 加密
        MessageDigest sha = MessageDigest.getInstance("sha");
        byte[] shaSecretBytes = sha.digest(content.getBytes());
        System.out.println("sha 加密 : { " + Base64Utils.encodeString(shaSecretBytes) + " }");

        /*
         * 对称加密 aes & des
         */
        //aes 加密
        KeyGenerator aesKeyGenerator = KeyGenerator.getInstance("aes");
        SecretKey aesSecretKey = aesKeyGenerator.generateKey();
        System.out.println("aes 加密 秘钥: { " + aesSecretKey.getFormat() + " }");
        Cipher aesCipher = Cipher.getInstance("aes");
        aesCipher.init(Cipher.ENCRYPT_MODE, aesSecretKey);
        byte[] aseResultBytes = aesCipher.doFinal(content.getBytes());
        System.out.println("aes 加密 : { " + Base64Utils.encodeString(aseResultBytes) + " }");

        //aes 解密
        aesCipher.init(Cipher.DECRYPT_MODE, aesSecretKey);
        aseResultBytes = aesCipher.doFinal(aseResultBytes);
        System.out.println("aes 解密: { " + new String(aseResultBytes) + " }");


        //des 加密
        KeyGenerator desKeyGenerator = KeyGenerator.getInstance("aes");
        SecretKey desSecretKey = desKeyGenerator.generateKey();
        Cipher desCipher = Cipher.getInstance("aes");
        desCipher.init(Cipher.ENCRYPT_MODE, desSecretKey);

        byte[] dseResultBytes = desCipher.doFinal(content.getBytes());
        System.out.println("des 加密 : { " + Base64Utils.encodeString(dseResultBytes) + " }");

        desCipher.init(Cipher.DECRYPT_MODE, desSecretKey);
        dseResultBytes = desCipher.doFinal(dseResultBytes);
        System.out.println("des 解密: { " + new String(dseResultBytes) + " }");

    }


}
